%% 指定每个分布的均值向量和协方差矩阵
%% 指定每个分布的均值向量和协方差矩阵
if dense == 1
    mu{1,1} = [2,1]; mu{1,2} = [3,5];mu{1,3} = [-2,4];mu{1,4} = [-2,-2];mu{1,5}=[1,6];
    covariance{1,1} = [1,0;0,1];covariance{1,2} = [1,0;0,1];covariance{1,3} = [1,0;0,1];
    covariance{1,4} = [1,0;0,1];covariance{1,5} = [1,0;0,1];
else
    mu{1,1} = [2,1]; mu{1,2} = [-4,6];mu{1,3} = [8,1];mu{1,4} = [-2,-4];mu{1,5}=[3,6];
    covariance{1,1} = [1,0;0,1];covariance{1,2} = [1,0;0,1];covariance{1,3} = [1,0;0,1];
    covariance{1,4} = [1,0;0,1];covariance{1,5} = [1,0;0,1];
end




